Revit 2026 API

# ComboBoxMemberDataGroupName Property

---

Gets or sets a group name for the ComboBoxMember.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GroupName { get; set; }
```
```vb
Public Property GroupName As String
	Get
	Set
```
```cpp
public:
property String^ GroupName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member GroupName : string with get, set
```

#### Property Value

String

The GroupName is used to group the items and also appears in the group header. All ComboBoxMembers assigned to the same group will be grouped in the ComboBox. There will be a header that shows the name. The default value is .

#### Reference

ComboBoxMemberData Class

Autodesk.Revit.UI Namespace